#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	АктуализацияПаролей();
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Если ПарольИзменен Тогда
		УстановитьПривилегированныйРежим(Истина);
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ТекущийОбъект.Ссылка, ПарольХранилище, "ПарольХранилище");
		УстановитьПривилегированныйРежим(Ложь);
		ПарольХранилище = ?(ЗначениеЗаполнено(ПарольХранилище), УникальныйИдентификатор, "");
		ПарольИзменен = Ложь;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ПарольХранилищеПриИзменении(Элемент)
	ПарольИзменен = Истина;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура АктуализацияПаролей()

	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		УстановитьПривилегированныйРежим(Истина);
		Пароли = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Объект.Ссылка, "ПарольХранилище");
		УстановитьПривилегированныйРежим(Ложь);
		ПарольХранилище = ?(ЗначениеЗаполнено(Пароли), УникальныйИдентификатор, "");
	КонецЕсли;

КонецПроцедуры
#КонецОбласти