#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.Почта.Видимость = Объект.УведомитьПоПочте;
	Элементы.ChatId.Видимость = Объект.УведомитьПоТелеграм;
	Элементы.BitrixId.Видимость = Объект.УведомлятьBitrix;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура УведомитьПоТелеграмПриИзменении(Элемент)
	Элементы.ChatId.Видимость = Объект.УведомитьПоТелеграм;
КонецПроцедуры

&НаКлиенте
Процедура УведомитьПоПочтеПриИзменении(Элемент)
	Элементы.Почта.Видимость = Объект.УведомитьПоПочте;
КонецПроцедуры

&НаКлиенте
Процедура УведомлятьBitrixПриИзменении(Элемент)
	Элементы.BitrixId.Видимость = Объект.УведомлятьBitrix;
КонецПроцедуры
#КонецОбласти