#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ЗначениеЗаполнено(ДатаОкончанияРабот) И ДатаОкончанияРабот < ДатаНачалаРабот Тогда
		ОбщегоНазначения.СообщитьПользователю("Время окончания работ не может быть меньше времени начала работ",
			ЭтотОбъект, "ДатаОкончанияРабот", , Отказ);
	КонецЕсли;
	Если ПланируемаяРабота <> Перечисления.ММ_ПланируемыеВидыРабот.Обновление Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ОбновляемаяБаза"));
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;

КонецПроцедуры
#КонецОбласти
#КонецЕсли