#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если Не УведомитьПоПочте Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Почта"));
	КонецЕсли;

	Если Не УведомитьПоТелеграм Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ChatId"));
	КонецЕсли;
	
	Если Не УведомлятьBitrix Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("BitrixId"));
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти
#КонецЕсли